app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
      def index
        respond_with Task.all

INSERT INTO "tasks" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sadád"], ["created_at", "2014-10-27 06:40:53.429686"], ["title", "asdaádas"], ["updated_at", "2014-10-27 06:40:53.429686"]]
---
      def create
        @task = Task.new task_params
        if @task.save

UPDATE "tasks" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "tasks"."id" = 17  [["content", "undefined"], ["title", "undefined"], ["updated_at", "2014-10-27 16:18:37.112879"]]
---
      def update
        if @task.update task_params

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
      def destroy
        respond_with Task.destroy params[:id]

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 17]]
---
      def find_model
        @task = Task.find(params[:id]) if params[:id]